renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/driver/r_usb_usbif_api.c
        err = usb_hstd_change_device_state(&utr, (usb_cb_t)&usb_hstd_resume_complete,
                                         USB_DO_GLOBAL_RESUME, p_ctrl->address);
        if (USB_OK == err)
        {
            g_usb_change_device_state[p_ctrl->module] |= (1 << USB_STS_RESUME);
        }
        else
        {
            ret_code = USB_ERR_NG;
        }
#else   /* (BSP_CFG_RTOS_USED == 0) */
        if (USB_YES == gs_usb_resume_ing[p_ctrl->module])
        {
            return USB_ERR_BUSY;
        }
        else
        {
            gs_usb_resume_ing[p_ctrl->module] = USB_YES;
        }

        err = usb_hstd_change_device_state(&utr, (usb_cb_t)&usb_hstd_resume_complete,
                                         USB_DO_GLOBAL_RESUME, p_ctrl->address);
        if (USB_OK != err)
        {
            ret_code = USB_ERR_NG;
        }

        gs_usb_resume_ing[p_ctrl->module] = USB_NO;

#endif  /* (BSP_CFG_RTOS_USED == 0) */

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)

#if (BSP_CFG_RTOS_USED == 0)

        /* Support remote wakeup ? */
        if (USB_TRUE == g_usb_pstd_remote_wakeup)
        {
            usb_pstd_change_device_state(USB_DO_REMOTEWAKEUP, USB_NULL, (usb_cb_t)usb_pstd_dummy_function);
            switch (g_usb_pstd_remote_wakeup_state)
            {
                case USB_OK:
                    ret_code = USB_SUCCESS;
                break;

                case USB_QOVR:
                    ret_code = USB_ERR_NOT_SUSPEND;
                break;

                case USB_ERROR:
                default:
                    ret_code = USB_ERR_NG;
                break;
            }
        }
        else
        {
            ret_code = USB_ERR_NG;
        }

#else   /* (BSP_CFG_RTOS_USED == 0) */

        if (USB_YES == gs_usb_resume_ing[USB_CFG_USE_USBIP])
        {
            return USB_ERR_BUSY;
        }
        else
        {
            gs_usb_resume_ing[USB_CFG_USE_USBIP] = USB_YES;
        }
        /* Support remote wakeup ? */
        if (USB_TRUE == g_usb_pstd_remote_wakeup)
        {
            usb_pstd_change_device_state(USB_DO_REMOTEWAKEUP, USB_NULL, (usb_cb_t)usb_pstd_dummy_function);
            switch (g_usb_pstd_remote_wakeup_state)
            {
                case USB_OK:
                    ret_code = USB_SUCCESS;
                break;

                case USB_QOVR:
                    ret_code = USB_ERR_NOT_SUSPEND;
                break;

                case USB_ERROR:
                default:
                    ret_code = USB_ERR_NG;
                break;
            }
        }
        else
        {
            ret_code = USB_ERR_NG;
        }
        gs_usb_resume_ing[USB_CFG_USE_USBIP] = USB_NO;

#endif  /* (BSP_CFG_RTOS_USED == 0) */

#else   /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI */
        ret_code = USB_ERR_NG;
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI */
    }

    return ret_code;
}
/******************************************************************************
 End of function R_USB_Resume
 ******************************************************************************/

/******************************************************************************
Function Name   : R_USB_VbusSetting
Description     : Contol of USB VBUS.(USB Host only)
Arguments       : usb_ctrl_t    *p_ctrl : Pointer to usb_ctrl_t structure
                : uint16_t      state   : HI/LOW assertion
Return value    : usb_err_t error code  : USB_SUCCESS,USB_ERR_NG etc.
******************************************************************************/
usb_err_t   R_USB_VbusSetting( usb_ctrl_t *p_ctrl, uint16_t state )
{

#if (USB_CFG_MODE == USB_CFG_PERI)
    return USB_ERR_NG;
#else
    usb_utr_t   utr;

    if (USB_PERI == g_usb_usbmode) 
    {
        return USB_ERR_NG;              /* Support Host only. */
    }

#if USB_CFG_PARAM_CHECKING == USB_CFG_ENABLE

    /* Argument Checking */
    if ((USB_IP0 != p_ctrl->module) && (USB_IP1 != p_ctrl->module))
    {
        return USB_ERR_PARA;
    }

#if defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX63N)  || defined(BSP_MCU_RX63T) || defined(BSP_MCU_RX72T)\
    || defined (BSP_MCU_RX72M)
    if (USB_IP1 == p_ctrl->module)
    {
        return USB_ERR_PARA;
    }
#endif /* defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX63N)  || defined(BSP_MCU_RX63T) || defined(BSP_MCU_RX72T)\
    || defined (BSP_MCU_RX72M)  */

    if (USB_NULL == p_ctrl)
    {
        return USB_ERR_PARA;
    }
    
    if ((USB_ON != state) && (USB_OFF != state))
    {
       return USB_ERR_PARA;
    }

#if defined(BSP_MCU_RX63N)
    if (USB_IP1 == p_ctrl->module && ( USB_HOST == g_usb_usbmode))
    {
        return USB_ERR_PARA;
    }
#endif

#endif  /* USB_CFG_PARAM_CHECKING == USB_CFG_ENABLE */

    utr.ip = p_ctrl->module;
    utr.ipp = usb_hstd_get_usb_ip_adr(utr.ip);

    if (USB_ON == state)
    {
        usb_hstd_vbus_control(&utr, (uint16_t)USB_VBON);
    }
    else
    {
        usb_hstd_vbus_control(&utr, (uint16_t)USB_VBOFF);
    }

    return USB_SUCCESS;
#endif /* (USB_CFG_MODE == USB_CFG_PERI) */
}
/******************************************************************************
 End of function R_USB_VbusSetting
 ******************************************************************************/

/******************************************************************************
Function Name   : R_USB_GetInformation
Description     : Get USB Informatio.(Device class,Connect speed,Device status)
Arguments       : usb_ctrl_t    *p_ctrl : Pointer to usb_ctrl_t structure
                : usb_info_t    *p_info : Pointer to usb_info_t structure
Return value    : usb_err_t error code  : USB_SUCCESS,USB_ERR_NG etc.
******************************************************************************/
usb_err_t   R_USB_GetInformation( usb_ctrl_t *p_ctrl, usb_info_t *p_info)
{
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
    usb_utr_t   utr;

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
    uint16_t    status;

