renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/driver/r_usb_usbif_api.c
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI */
    }
    return USB_SUCCESS;
}
/******************************************************************************
 End of function R_USB_GetInformation
 ******************************************************************************/

/******************************************************************************
Function Name   : R_USB_PipeRead
Description     : USB Data receive process for Vendor class.
Arguments       : usb_ctrl_t    *p_ctrl : Pointer to usb_ctrl_t structure
                : uint8_t       *buf    : Pointer to the data buffer area
                : uint32_t      size    : Read size
Return value    : usb_err_t error code  : USB_SUCCESS,USB_ERR_NG etc.
******************************************************************************/
usb_err_t  R_USB_PipeRead(usb_ctrl_t *p_ctrl, uint8_t *buf, uint32_t size)
{
#if !defined(USB_CFG_HVND_USE) && !defined(USB_CFG_PVND_USE)
    return USB_ERR_NG;
#else   /* !defined(USB_CFG_HVND_USE) && !defined(USB_CFG_PVND_USE) */

    usb_err_t   ret_code = USB_ERR_NG;
    usb_utr_t   *p_tran_data;
#if (BSP_CFG_RTOS_USED == 1)
    usb_utr_t   tran_data;
#endif /* BSP_CFG_RTOS_USED == 1 */

    usb_er_t    err;
    usb_info_t  info;

#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
    if (USB_PERI == g_usb_usbmode)
    {
        p_ctrl->module = USB_CFG_USE_USBIP;
    }
#endif  /* USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI */

#if USB_CFG_PARAM_CHECKING == USB_CFG_ENABLE
    if (((USB_NULL == p_ctrl) || (USB_PIPE0 == p_ctrl->pipe)) || (USB_MAXPIPE_NUM < p_ctrl->pipe))
    {
        return USB_ERR_PARA;
    }

    if ((USB_NULL == buf) || (USB_NULL == size))
    {
        return USB_ERR_PARA;
    }

    /* Argument Checking */
    if ((USB_IP0 != p_ctrl->module) && (USB_IP1 != p_ctrl->module) && ( USB_HOST == g_usb_usbmode))
    {
        return USB_ERR_PARA;
    }

#if defined(BSP_MCU_RX63N) || defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX630) || defined(BSP_MCU_RX63T)\
    || defined(BSP_MCU_RX72T) || defined (BSP_MCU_RX72M)
    if ((USB_IP1 == p_ctrl->module) && (USB_HOST == g_usb_usbmode))
    {
        return USB_ERR_PARA;
    }
#endif /* #if defined(BSP_MCU_RX63N) || defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX630) || defined(BSP_MCU_RX63T)\
    || defined(BSP_MCU_RX72T) || defined (BSP_MCU_RX72M)   */

    if (USB_NULL == (g_usb_open_class[p_ctrl->module] & (1 << p_ctrl->type)))      /* Check USB Open device class */
    {
        return USB_ERR_PARA;
    }

#if defined(BSP_MCU_RX63N)
    if (USB_IP1 == p_ctrl->module && ( USB_HOST == g_usb_usbmode))
    {
        return USB_ERR_PARA;
    }
#endif

#endif  /* USB_CFG_PARAM_CHECKING == USB_CFG_ENABLE */

    R_USB_GetInformation(p_ctrl, &info);
    if (USB_STS_CONFIGURED == info.status)
    {
        /* PIPE Transfer set */
        if (USB_HOST == g_usb_usbmode)
        {
    #if defined(USB_CFG_HVND_USE)
      #if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)

#if (BSP_CFG_RTOS_USED == 1)
            p_tran_data = (usb_utr_t *)&tran_data;
#else  /* BSP_CFG_RTOS_USED == 1 */
            p_tran_data = (usb_utr_t *)&g_usb_hdata[p_ctrl->module][p_ctrl->pipe];
#endif /* BSP_CFG_RTOS_USED == 1 */

            p_tran_data->ip = p_ctrl->module;
            p_tran_data->ipp = usb_hstd_get_usb_ip_adr(p_tran_data->ip);
            p_tran_data->keyword     = p_ctrl->pipe;             /* Pipe No */
            p_tran_data->p_tranadr   = buf;                      /* Data address */
            p_tran_data->tranlen     = size;                     /* Data Size */
            p_tran_data->p_setup     = 0;
            p_tran_data->complete    = usb_hvnd_read_complete;   /* Callback function */
            p_tran_data->segment     = USB_TRAN_END;
            *(uint32_t *)p_tran_data->p_usr_data = p_ctrl->address;
            p_tran_data->read_req_len= size;                     /* Data Size */

            err = usb_hstd_transfer_start(p_tran_data);        /* USB Transfer Start */
            if (USB_OK == err)
            {
                ret_code = USB_SUCCESS;
            }
            else if (USB_QOVR == err)
            {
                ret_code = USB_ERR_BUSY;
            }
            else
            {
            }
      #endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    #endif /* #if defined(USB_CFG_HVND_USE) */
        }
        else
        {
    #if defined(USB_CFG_PVND_USE)
      #if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)

#if (BSP_CFG_RTOS_USED == 1)
            p_tran_data = (usb_utr_t *)&tran_data;
#else  /* BSP_CFG_RTOS_USED == 1 */
            p_tran_data = (usb_utr_t *)&g_usb_pdata[p_ctrl->pipe];
#endif /* BSP_CFG_RTOS_USED == 1 */

            p_tran_data->keyword    = p_ctrl->pipe;        /* Pipe No */
            p_tran_data->p_tranadr  = buf;                 /* Data address */
            p_tran_data->tranlen    = size;                /* Data Size */
            p_tran_data->complete   = (usb_cb_t)&usb_pvnd_read_complete;   /* Callback function */
            p_tran_data->read_req_len= size;                     /* Data Size */
            err = usb_pstd_transfer_start(p_tran_data);   /* USB Transfer Start */
            if (USB_OK == err)
            {
                ret_code = USB_SUCCESS;
            }
            else if (USB_QOVR == err)
            {
                ret_code = USB_ERR_BUSY;
            }
            else
            {
            }
      #endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI */
    #endif  /* defined(USB_CFG_PVND_USE) */
        }
    }

    return ret_code;
#endif  /* !defined(USB_CFG_HVND_USE) && !defined(USB_CFG_PVND_USE) */
}
/******************************************************************************
 End of function R_USB_PipeRead
 ******************************************************************************/

/******************************************************************************
Function Name   : R_USB_PipeWrite
Description     : USB Data send process for Vendor class.
Arguments       : usb_ctrl_t    *p_ctrl : Pointer to usb_ctrl_t structure
                : uint8_t       *buf    : Pointer to the data buffer area
                : uint32_t      size    : Write size
Return value    : usb_err_t error code  : USB_SUCCESS,USB_ERR_NG etc.
******************************************************************************/
usb_err_t  R_USB_PipeWrite(usb_ctrl_t *p_ctrl, uint8_t *buf, uint32_t size)
{
#if !defined(USB_CFG_HVND_USE) && !defined(USB_CFG_PVND_USE)
    return USB_ERR_NG;
#else   /* !defined(USB_CFG_HVND_USE) && !defined(USB_CFG_PVND_USE) */

    usb_er_t    err;
    usb_err_t   ret_code = USB_ERR_NG;
    usb_info_t  info;
    usb_utr_t   *p_tran_data;
#if (BSP_CFG_RTOS_USED == 1)
    usb_utr_t   tran_data;
#endif /* BSP_CFG_RTOS_USED == 1 */

#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
    if (USB_PERI == g_usb_usbmode)
    {
        p_ctrl->module = USB_CFG_USE_USBIP;
    }
#endif  /* USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI */

#if USB_CFG_PARAM_CHECKING == USB_CFG_ENABLE
        /* Argument Checking */
    if ((USB_IP0 != p_ctrl->module) && (USB_IP1 != p_ctrl->module) && ( USB_HOST == g_usb_usbmode))
    {
        return USB_ERR_PARA;
    }

#if defined(BSP_MCU_RX63N) || defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX630) || defined(BSP_MCU_RX63T)\
    || defined(BSP_MCU_RX72T) || defined (BSP_MCU_RX72M)
    if (USB_IP1 == p_ctrl->module)
    {
        return USB_ERR_PARA;
    }
#endif /* defined(BSP_MCU_RX63N) || defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX630) || defined(BSP_MCU_RX63T)\
    || defined(BSP_MCU_RX72T) || defined (BSP_MCU_RX72M) */

    if (((USB_NULL == p_ctrl) || (USB_NULL == buf) || (USB_PIPE0 == p_ctrl->pipe)) || (USB_MAXPIPE_NUM < p_ctrl->pipe))
    {
        return USB_ERR_PARA;
    }

    if (USB_NULL == (g_usb_open_class[p_ctrl->module] & (1 << p_ctrl->type)))      /* Check USB Open device class */
    {
        return USB_ERR_PARA;
    }

#if defined(BSP_MCU_RX63N)
    if (USB_IP1 == p_ctrl->module && ( USB_HOST == g_usb_usbmode))
    {
        return USB_ERR_PARA;
    }
#endif

#endif  /* USB_CFG_PARAM_CHECKING == USB_CFG_ENABLE */

