renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/driver/r_usb_usbif_api.c
    R_USB_GetInformation(p_ctrl, &info);
    if (USB_STS_CONFIGURED == info.status)
    {
        /* PIPE Transfer set */
        if (USB_HOST == g_usb_usbmode)
        {
    #if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
      #if defined(USB_CFG_HVND_USE)

#if (BSP_CFG_RTOS_USED == 1)
            p_tran_data = (usb_utr_t *)&tran_data;
#else  /* BSP_CFG_RTOS_USED == 1 */
            p_tran_data = (usb_utr_t *)&g_usb_hdata[p_ctrl->module][p_ctrl->pipe];
#endif /* BSP_CFG_RTOS_USED == 1 */

            p_tran_data->ip                                     = p_ctrl->module;
            p_tran_data->ipp                                    = usb_hstd_get_usb_ip_adr((uint8_t) p_ctrl->module);
            p_tran_data->keyword                                = p_ctrl->pipe;                 /* Pipe No */
            p_tran_data->p_tranadr                              = buf;                          /* Data address */
            p_tran_data->tranlen                                = size;                         /* Data Size */
            p_tran_data->complete                               = usb_hvnd_write_complete;   /* Callback function */
            p_tran_data->segment                                = USB_TRAN_END;
            err = usb_hstd_transfer_start(p_tran_data);
            if (USB_OK == err)
            {
                ret_code = USB_SUCCESS;
            }
            else if (USB_QOVR == err)
            {
                ret_code = USB_ERR_BUSY;
            }
            else
            {
            }
      #endif  /* defined(USB_CFG_HVND_USE) */
    #endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
        }
        else
        {
    #if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
        #if defined(USB_CFG_PVND_USE)

#if (BSP_CFG_RTOS_USED == 1)
            p_tran_data = (usb_utr_t *)&tran_data;
#else  /* BSP_CFG_RTOS_USED == 1 */
            p_tran_data = (usb_utr_t *)&g_usb_pdata[p_ctrl->pipe];
#endif /* BSP_CFG_RTOS_USED == 1 */

            p_tran_data->keyword                = p_ctrl->pipe;                         /* Pipe No */
            p_tran_data->p_tranadr              = buf;                                  /* Data address */
            p_tran_data->tranlen                = size;                                 /* Data Size */
            p_tran_data->complete               = usb_pvnd_write_complete;              /* Callback function */
            err = usb_pstd_transfer_start(p_tran_data);

            if (USB_OK == err)
            {
                ret_code = USB_SUCCESS;
            }
            else if (USB_QOVR == err)
            {
                ret_code = USB_ERR_BUSY;
            }
            else
            {
            }
        #endif  /* defined(USB_CFG_PVND_USE) */
    #endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI */
        }
    }

    return ret_code;
#endif /* #if !defined(USB_CFG_HVND_USE) && !defined(USB_CFG_PVND_USE) */

}
/******************************************************************************
 End of function R_USB_PipeWrite
 ******************************************************************************/

/******************************************************************************
Function Name   : R_USB_PipeStop
Description     : USB transfer stop process for Vendor class.
Arguments       : usb_ctrl_t    *p_ctrl : Pointer to usb_ctrl_t structure
Return value    : usb_err_t error code  : USB_SUCCESS,USB_ERR_NG etc.
******************************************************************************/
usb_err_t    R_USB_PipeStop(usb_ctrl_t *p_ctrl)
{
#if !defined(USB_CFG_HVND_USE) && !defined(USB_CFG_PVND_USE)
    return USB_ERR_NG;
#else
    
    usb_er_t    err = USB_ERR_NG;
    usb_err_t   ret_code = USB_ERR_NG;
    usb_info_t  info;

#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
    usb_utr_t   utr;

    if (USB_HOST == g_usb_usbmode)
    {
        utr.ip = p_ctrl->module;
        utr.ipp = usb_hstd_get_usb_ip_adr(utr.ip);
    }

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */

#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
    if (USB_PERI == g_usb_usbmode)
    {
        p_ctrl->module = USB_CFG_USE_USBIP;
    }
#endif  /* USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI */

#if USB_CFG_PARAM_CHECKING == USB_CFG_ENABLE
    /* Argument Checking */
    if ((USB_IP0 != p_ctrl->module) && (USB_IP1 != p_ctrl->module) && ( USB_HOST == g_usb_usbmode))
    {
        return USB_ERR_PARA;
    }

#if defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX630) || defined(BSP_MCU_RX63T) || defined(BSP_MCU_RX72T)\
    || defined (BSP_MCU_RX72M)
    if (USB_IP1 == p_ctrl->module)
    {
        return USB_ERR_PARA;
    }
#endif  /* defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX630) || defined(BSP_MCU_RX63T) || defined(BSP_MCU_RX72T)\
    || defined (BSP_MCU_RX72M) */

#if defined(BSP_MCU_RX63N)
    if ((USB_IP1 == p_ctrl->module) && (USB_HOST == g_usb_usbmode))
    {
        return USB_ERR_PARA;
    }
#endif

    if ((USB_NULL == p_ctrl) || (USB_PIPE0 == p_ctrl->pipe) || (USB_MAXPIPE_NUM < p_ctrl->pipe))
    {
        return USB_ERR_PARA;
    }

    if (USB_NULL == (g_usb_open_class[p_ctrl->module] & (1 << p_ctrl->type)))      /* Check USB Open device class */
    {
        return USB_ERR_PARA;
    }

#endif  /* USB_CFG_PARAM_CHECKING == USB_CFG_ENABLE */

    err = R_USB_GetInformation(p_ctrl, &info);
    if (USB_STS_CONFIGURED != info.status)
    {
        return USB_ERR_NG;
    }

    if (USB_HOST == g_usb_usbmode)
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        err = usb_hstd_transfer_end(&utr, p_ctrl->pipe, (uint16_t)USB_DATA_STOP);

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
        err = usb_pstd_transfer_end(p_ctrl->pipe);

#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI */
    }
    if (USB_OK == err)
    {
        ret_code = USB_SUCCESS;
    }

    return ret_code;
#endif /* !defined(USB_CFG_HVND_USE) && !defined(USB_CFG_PVND_USE) */
}
/******************************************************************************
 End of function R_USB_PipeStop
 ******************************************************************************/

