renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/driver/r_usb_usbif_api.c
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI */
    }
    return USB_ERR_NG;
}
/******************************************************************************
 End of function R_USB_GetPipeInfo
 ******************************************************************************/

/******************************************************************************
Function Name   : R_USB_PullUp
Description     : Contol of USB D+/D- line pull-up.(USB Peripheral only)
Arguments       : uint16_t      state   : USB_ON(Enable)/USB_OFF(Disable)
Return value    : usb_err_t error code  : USB_SUCCESS,USB_ERR_NG etc.
******************************************************************************/
usb_err_t   R_USB_PullUp(uint8_t state)
{

#if (USB_CFG_MODE == USB_CFG_HOST)
    return USB_ERR_NG;
#else /* USB_CFG_MODE == USB_CFG_HOST */

    if (USB_HOST == g_usb_usbmode) 
    {
        return USB_ERR_NG;              /* Support Host only. */
    }

    /* Argument Checking */

    if ((USB_ON != state) && (USB_OFF != state))
    {
       return USB_ERR_PARA;
    }

    if (USB_ON == state)
    {
        hw_usb_pset_dprpu();
    }
    else
    {
        hw_usb_pclear_dprpu();
    }

    return USB_SUCCESS;
#endif /* USB_CFG_MODE == USB_CFG_HOST */
} /* End of function R_USB_GetPipeInfo */
/******************************************************************************
 End of function R_USB_PullUp
 ******************************************************************************/

/******************************************************************************
End  Of File
******************************************************************************/
